MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VMD18/mcu.h
#define ID                            (*((volatile uint32_t *)0x000))      // Identification Register (ID)
#define HWGENERAL                     (*((volatile uint32_t *)0x004))      // General Hardware Parameters (HWGENERAL)
#define HWHOST                        (*((volatile uint32_t *)0x008))      // Host Hardware Parameters (HWHOST)
#define HWDEVICE                      (*((volatile uint32_t *)0x00C))      // Device Hardware Parameters (HWDEVICE)
#define HWTXBUF                       (*((volatile uint32_t *)0x010))      // TX Buffer Hardware Parameters (HWTXBUF)
#define HWRXBUF                       (*((volatile uint32_t *)0x014))      // RX Buffer Hardware Parameters (HWRXBUF)
#define GPTIMER0LD                    (*((volatile uint32_t *)0x080))      // General Purpose Timer 0 Load (GPTIMER0LD)
#define GPTIMER0CTL                   (*((volatile uint32_t *)0x084))      // General Purpose Timer 0 Control (GPTIMER0CTL)
#define GPTIMER1LD                    (*((volatile uint32_t *)0x088))      // General Purpose Timer 1 Load (GPTIMER1LD)
#define GPTIMER1CTL                   (*((volatile uint32_t *)0x08C))      // General Purpose Timer 1 Control (GPTIMER1CTL)
#define HCIVERSION                    (*((volatile uint32_t *)0x100))      // Host Interface Version Number (HCIVERSION)
#define CAPLENGTH                     (*((volatile uint32_t *)0x103))      // Capability Register Length (CAPLENGTH)
#define HCSPARAMS                     (*((volatile uint32_t *)0x104))      // Host Structural Parameters (HCSPARAMS)
#define HCCPARAMS                     (*((volatile uint32_t *)0x108))      // Host Capability Parameters (HCCPARAMS)
#define DCIVERSION                    (*((volatile uint32_t *)0x122))      // Device Interface Version Number (DCIVERSION)
#define DCCPARAMS                     (*((volatile uint32_t *)0x124))      // Device Capability Parameters (DCCPARAMS)
#define USBCMD                        (*((volatile uint32_t *)0x140))      // USB Command (USBCMD)
#define USBSTS                        (*((volatile uint32_t *)0x144))      // USB Status (USBSTS)
#define USBINTR                       (*((volatile uint32_t *)0x148))      // USB Interrupt Enable (USBINTR)
#define FRINDEX                       (*((volatile uint32_t *)0x14C))      // USB Frame Index (FRINDEX)
#define PERIODICLISTBASE              (*((volatile uint32_t *)0x154))      // Periodic Frame List Base Address (PERIODICLISTBASE)
#define DEVICEADDR                    (*((volatile uint32_t *)0x154))      // Device Address (DEVICEADDR)
#define ASYNCLISTADDR                 (*((volatile uint32_t *)0x158))      // Current Asynchronous List Address (ASYNCLISTADDR)
#define EPLISTADDR                    (*((volatile uint32_t *)0x158))      // Address at Endpoint List (EPLISTADDR)
#define TTCTRL                        (*((volatile uint32_t *)0x15C))      // Host TT Asynchronous Buffer Control (TTCTRL)
#define BURSTSIZE                     (*((volatile uint32_t *)0x160))      // Master Interface Data Burst Size (BURSTSIZE)
#define TXFILLTUNING                  (*((volatile uint32_t *)0x164))      // Host Transmit FIFO Tuning Control (TXFILLTUNING)
#define CONFIGFLAG                    (*((volatile uint32_t *)0x180))      // Configure Flag Register (CONFIGFLAG)
#define PORTSC1                       (*((volatile uint32_t *)0x184))      // Port Status/Control (PORTSC1)
#define OTGSC                         (*((volatile uint32_t *)0x1A4))      // On-The-Go Status and Control (OTGSC)
#define MODE                          (*((volatile uint32_t *)0x1A8))      // USB Mode Register (MODE)
#define EPSETUPSR                     (*((volatile uint32_t *)0x1AC))      // Endpoint Setup Status Register (EPSETUPSR)
#define EPPRIME                       (*((volatile uint32_t *)0x1B0))      // Endpoint Initialization (EPPRIME)
#define EPFLUSH                       (*((volatile uint32_t *)0x1B4))      // Endpoint De-initialize (EPFLUSH)
#define EPSR                          (*((volatile uint32_t *)0x1B8))      // Endpoint Status Register (EPSR)
#define EPCOMPLETE                    (*((volatile uint32_t *)0x1BC))      // Endpoint Complete (EPCOMPLETE)
#define EPCR0                         (*((volatile uint32_t *)0x1C0))      // Endpoint Control Register 0 (EPCR0)
#define EPCR1                         (*((volatile uint32_t *)0x1C4))      // Endpoint Control Register 1 (EPCR1)
#define EPCR2                         (*((volatile uint32_t *)0x1C8))      // Endpoint Control Register 2 (EPCR2)
#define EPCR3                         (*((volatile uint32_t *)0x1CC))      // Endpoint Control Register 3 (EPCR3)
#define EPCR4                         (*((volatile uint32_t *)0x1D0))      // Endpoint Control Register 4 (EPCR4)
#define EPCR5                         (*((volatile uint32_t *)0x1D4))      // Endpoint Control Register 5 (EPCR5)
#define EPCR6                         (*((volatile uint32_t *)0x1D8))      // Endpoint Control Register 6(EPCR6)
#define EPCR7                         (*((volatile uint32_t *)0x1DC))      // Endpoint Control Register 7(EPCR7)


//*****************************************************************************
//
// Universal Serial Bus 2.0 Integrated PHY (USB-PHY) registers
//
//*****************************************************************************

#define USBPHY_PWD                    (*((volatile uint32_t *)0x400A2000))      // USB PHY Power-Down Register (USBPHY_PWD)
#define USBPHY_PWD_SET                (*((volatile uint32_t *)0x400A2004))      // USB PHY Power-Down Register (USBPHY_PWD_SET)
#define USBPHY_PWD_CLR                (*((volatile uint32_t *)0x400A2008))      // USB PHY Power-Down Register (USBPHY_PWD_CLR)
#define USBPHY_PWD_TOG                (*((volatile uint32_t *)0x400A200C))      // USB PHY Power-Down Register (USBPHY_PWD_TOG)
#define USBPHY_TX                     (*((volatile uint32_t *)0x400A2010))      // USB PHY Transmitter Control Register (USBPHY_TX)
#define USBPHY_TX_SET                 (*((volatile uint32_t *)0x400A2014))      // USB PHY Transmitter Control Register (USBPHY_TX_SET)
#define USBPHY_TX_CLR                 (*((volatile uint32_t *)0x400A2018))      // USB PHY Transmitter Control Register (USBPHY_TX_CLR)
#define USBPHY_TX_TOG                 (*((volatile uint32_t *)0x400A201C))      // USB PHY Transmitter Control Register (USBPHY_TX_TOG)
#define USBPHY_RX                     (*((volatile uint32_t *)0x400A2020))      // USB PHY Receiver Control Register (USBPHY_RX)
#define USBPHY_RX_SET                 (*((volatile uint32_t *)0x400A2024))      // USB PHY Receiver Control Register (USBPHY_RX_SET)
#define USBPHY_RX_CLR                 (*((volatile uint32_t *)0x400A2028))      // USB PHY Receiver Control Register (USBPHY_RX_CLR)
#define USBPHY_RX_TOG                 (*((volatile uint32_t *)0x400A202C))      // USB PHY Receiver Control Register (USBPHY_RX_TOG)
#define USBPHY_CTRL                   (*((volatile uint32_t *)0x400A2030))      // USB PHY General Control Register (USBPHY_CTRL)
#define USBPHY_CTRL_SET               (*((volatile uint32_t *)0x400A2034))      // USB PHY General Control Register (USBPHY_CTRL_SET)
#define USBPHY_CTRL_CLR               (*((volatile uint32_t *)0x400A2038))      // USB PHY General Control Register (USBPHY_CTRL_CLR)
#define USBPHY_CTRL_TOG               (*((volatile uint32_t *)0x400A203C))      // USB PHY General Control Register (USBPHY_CTRL_TOG)
#define USBPHY_STATUS                 (*((volatile uint32_t *)0x400A2040))      // USB PHY Status Register (USBPHY_STATUS)
#define USBPHY_DEBUG                  (*((volatile uint32_t *)0x400A2050))      // USB PHY Debug Register (USBPHY_DEBUG)
#define USBPHY_DEBUG_SET              (*((volatile uint32_t *)0x400A2054))      // USB PHY Debug Register (USBPHY_DEBUG_SET)
#define USBPHY_DEBUG_CLR              (*((volatile uint32_t *)0x400A2058))      // USB PHY Debug Register (USBPHY_DEBUG_CLR)
#define USBPHY_DEBUG_TOG              (*((volatile uint32_t *)0x400A205C))      // USB PHY Debug Register (USBPHY_DEBUG_TOG)
#define USBPHY_DEBUG0_STATUS          (*((volatile uint32_t *)0x400A2060))      // UTMI Debug Status Register 0
#define USBPHY_DEBUG1                 (*((volatile uint32_t *)0x400A2070))      // UTMI Debug Status Register 1 (USBPHY_DEBUG1)
#define USBPHY_DEBUG1_SET             (*((volatile uint32_t *)0x400A2074))      // UTMI Debug Status Register 1 (USBPHY_DEBUG1_SET)
#define USBPHY_DEBUG1_CLR             (*((volatile uint32_t *)0x400A2078))      // UTMI Debug Status Register 1 (USBPHY_DEBUG1_CLR)
#define USBPHY_DEBUG1_TOG             (*((volatile uint32_t *)0x400A207C))      // UTMI Debug Status Register 1 (USBPHY_DEBUG1_TOG)
#define USBPHY_VERSION                (*((volatile uint32_t *)0x400A2080))      // UTMI RTL Version (USBPHY_VERSION)
#define USBPHY_PLL_SIC                (*((volatile uint32_t *)0x400A20A0))      // USB PHY PLL Control/Status Register (USBPHY_PLL_SIC)
#define USBPHY_PLL_SIC_SET            (*((volatile uint32_t *)0x400A20A4))      // USB PHY PLL Control/Status Register (USBPHY_PLL_SIC_SET)
#define USBPHY_PLL_SIC_CLR            (*((volatile uint32_t *)0x400A20A8))      // USB PHY PLL Control/Status Register (USBPHY_PLL_SIC_CLR)
#define USBPHY_PLL_SIC_TOG            (*((volatile uint32_t *)0x400A20AC))      // USB PHY PLL Control/Status Register (USBPHY_PLL_SIC_TOG)
#define USBPHY_USB1_VBUS_DETECT       (*((volatile uint32_t *)0x400A20C0))      // USB PHY VBUS Detect Control Register (USBPHY_USB1_VBUS_DETECT)
#define USBPHY_USB1_VBUS_DETECT_SET   (*((volatile uint32_t *)0x400A20C4))      // USB PHY VBUS Detect Control Register (USBPHY_USB1_VBUS_DETECT_SET)
#define USBPHY_USB1_VBUS_DETECT_CLR   (*((volatile uint32_t *)0x400A20C8))      // USB PHY VBUS Detect Control Register (USBPHY_USB1_VBUS_DETECT_CLR)
#define USBPHY_USB1_VBUS_DETECT_TOG   (*((volatile uint32_t *)0x400A20CC))      // USB PHY VBUS Detect Control Register (USBPHY_USB1_VBUS_DETECT_TOG)
#define USBPHY_USB1_VBUS_DET_STAT     (*((volatile uint32_t *)0x400A20D0))      // USB PHY VBUS Detector Status Register (USBPHY_USB1_VBUS_DET_STAT)
#define USBPHY_USB1_CHRG_DET_STAT     (*((volatile uint32_t *)0x400A20F0))      // USB PHY Charger Detect Status Register (USBPHY_USB1_CHRG_DET_STAT)
#define USBPHY_ANACTRL                (*((volatile uint32_t *)0x400A2100))      // USB PHY Analog Control Register (USBPHY_ANACTRL)
#define USBPHY_ANACTRL_SET            (*((volatile uint32_t *)0x400A2104))      // USB PHY Analog Control Register (USBPHY_ANACTRL_SET)
#define USBPHY_ANACTRL_CLR            (*((volatile uint32_t *)0x400A2108))      // USB PHY Analog Control Register (USBPHY_ANACTRL_CLR)
#define USBPHY_ANACTRL_TOG            (*((volatile uint32_t *)0x400A210C))      // USB PHY Analog Control Register (USBPHY_ANACTRL_TOG)
#define USBPHY_USB1_LOOPBACK          (*((volatile uint32_t *)0x400A2110))      // USB PHY Loopback Control/Status Register (USBPHY_USB1_LOOPBACK)
#define USBPHY_USB1_LOOPBACK_SET      (*((volatile uint32_t *)0x400A2114))      // USB PHY Loopback Control/Status Register (USBPHY_USB1_LOOPBACK_SET)
#define USBPHY_USB1_LOOPBACK_CLR      (*((volatile uint32_t *)0x400A2118))      // USB PHY Loopback Control/Status Register (USBPHY_USB1_LOOPBACK_CLR)
#define USBPHY_USB1_LOOPBACK_TOG      (*((volatile uint32_t *)0x400A211C))      // USB PHY Loopback Control/Status Register (USBPHY_USB1_LOOPBACK_TOG)
#define USBPHY_USB1_LOOPBACK_HSFSCNT  (*((volatile uint32_t *)0x400A2120))      // USB PHY Loopback Packet Number Select Register (USBPHY_USB1_LOOPBACK_HSFSCNT)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET(*((volatile uint32_t *)0x400A2124))      // USB PHY Loopback Packet Number Select Register (USBPHY_USB1_LOOPBACK_HSFSCNT_SET)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR(*((volatile uint32_t *)0x400A2128))      // USB PHY Loopback Packet Number Select Register (USBPHY_USB1_LOOPBACK_HSFSCNT_CLR)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG(*((volatile uint32_t *)0x400A212C))      // USB PHY Loopback Packet Number Select Register (USBPHY_USB1_LOOPBACK_HSFSCNT_TOG)
#define USBPHY_TRIM_OVERRIDE_EN       (*((volatile uint32_t *)0x400A2130))      // USB PHY Trim Override Enable Register (USBPHY_TRIM_OVERRIDE_EN)
#define USBPHY_TRIM_OVERRIDE_EN_SET   (*((volatile uint32_t *)0x400A2134))      // USB PHY Trim Override Enable Register (USBPHY_TRIM_OVERRIDE_EN_SET)
#define USBPHY_TRIM_OVERRIDE_EN_CLR   (*((volatile uint32_t *)0x400A2138))      // USB PHY Trim Override Enable Register (USBPHY_TRIM_OVERRIDE_EN_CLR)
#define USBPHY_TRIM_OVERRIDE_EN_TOG   (*((volatile uint32_t *)0x400A213C))      // USB PHY Trim Override Enable Register (USBPHY_TRIM_OVERRIDE_EN_TOG)


//*****************************************************************************
//
// CAN (FlexCAN) registers
//
//*****************************************************************************

#define CAN0_MCR                      (*((volatile uint32_t *)0x40024000))      // Module Configuration Register
#define CAN0_CTRL1                    (*((volatile uint32_t *)0x40024004))      // Control 1 register
#define CAN0_TIMER                    (*((volatile uint32_t *)0x40024008))      // Free Running Timer
#define CAN0_RXMGMASK                 (*((volatile uint32_t *)0x40024010))      // Rx Mailboxes Global Mask Register
#define CAN0_RX14MASK                 (*((volatile uint32_t *)0x40024014))      // Rx 14 Mask register
#define CAN0_RX15MASK                 (*((volatile uint32_t *)0x40024018))      // Rx 15 Mask register
#define CAN0_ECR                      (*((volatile uint32_t *)0x4002401C))      // Error Counter
#define CAN0_ESR1                     (*((volatile uint32_t *)0x40024020))      // Error and Status 1 register
#define CAN0_IMASK1                   (*((volatile uint32_t *)0x40024028))      // Interrupt Masks 1 register
#define CAN0_IFLAG1                   (*((volatile uint32_t *)0x40024030))      // Interrupt Flags 1 register
#define CAN0_CTRL2                    (*((volatile uint32_t *)0x40024034))      // Control 2 register
#define CAN0_ESR2                     (*((volatile uint32_t *)0x40024038))      // Error and Status 2 register
#define CAN0_CRCR                     (*((volatile uint32_t *)0x40024044))      // CRC Register
#define CAN0_RXFGMASK                 (*((volatile uint32_t *)0x40024048))      // Rx FIFO Global Mask register
#define CAN0_RXFIR                    (*((volatile uint32_t *)0x4002404C))      // Rx FIFO Information Register
#define CAN0_RXIMR0                   (*((volatile uint32_t *)0x40024880))      // Rx Individual Mask Registers
#define CAN0_RXIMR1                   (*((volatile uint32_t *)0x40024884))      // Rx Individual Mask Registers
#define CAN0_RXIMR2                   (*((volatile uint32_t *)0x40024888))      // Rx Individual Mask Registers
#define CAN0_RXIMR3                   (*((volatile uint32_t *)0x4002488C))      // Rx Individual Mask Registers
#define CAN0_RXIMR4                   (*((volatile uint32_t *)0x40024890))      // Rx Individual Mask Registers
#define CAN0_RXIMR5                   (*((volatile uint32_t *)0x40024894))      // Rx Individual Mask Registers
#define CAN0_RXIMR6                   (*((volatile uint32_t *)0x40024898))      // Rx Individual Mask Registers
#define CAN0_RXIMR7                   (*((volatile uint32_t *)0x4002489C))      // Rx Individual Mask Registers
#define CAN0_RXIMR8                   (*((volatile uint32_t *)0x400248A0))      // Rx Individual Mask Registers
#define CAN0_RXIMR9                   (*((volatile uint32_t *)0x400248A4))      // Rx Individual Mask Registers
#define CAN0_RXIMR10                  (*((volatile uint32_t *)0x400248A8))      // Rx Individual Mask Registers
#define CAN0_RXIMR11                  (*((volatile uint32_t *)0x400248AC))      // Rx Individual Mask Registers
#define CAN0_RXIMR12                  (*((volatile uint32_t *)0x400248B0))      // Rx Individual Mask Registers
#define CAN0_RXIMR13                  (*((volatile uint32_t *)0x400248B4))      // Rx Individual Mask Registers
#define CAN0_RXIMR14                  (*((volatile uint32_t *)0x400248B8))      // Rx Individual Mask Registers
#define CAN0_RXIMR15                  (*((volatile uint32_t *)0x400248BC))      // Rx Individual Mask Registers
#define CAN1_MCR                      (*((volatile uint32_t *)0x400A4000))      // Module Configuration Register
#define CAN1_CTRL1                    (*((volatile uint32_t *)0x400A4004))      // Control 1 register
#define CAN1_TIMER                    (*((volatile uint32_t *)0x400A4008))      // Free Running Timer
#define CAN1_RXMGMASK                 (*((volatile uint32_t *)0x400A4010))      // Rx Mailboxes Global Mask Register
#define CAN1_RX14MASK                 (*((volatile uint32_t *)0x400A4014))      // Rx 14 Mask register
#define CAN1_RX15MASK                 (*((volatile uint32_t *)0x400A4018))      // Rx 15 Mask register
#define CAN1_ECR                      (*((volatile uint32_t *)0x400A401C))      // Error Counter
#define CAN1_ESR1                     (*((volatile uint32_t *)0x400A4020))      // Error and Status 1 register
#define CAN1_IMASK1                   (*((volatile uint32_t *)0x400A4028))      // Interrupt Masks 1 register
#define CAN1_IFLAG1                   (*((volatile uint32_t *)0x400A4030))      // Interrupt Flags 1 register
#define CAN1_CTRL2                    (*((volatile uint32_t *)0x400A4034))      // Control 2 register
#define CAN1_ESR2                     (*((volatile uint32_t *)0x400A4038))      // Error and Status 2 register
#define CAN1_CRCR                     (*((volatile uint32_t *)0x400A4044))      // CRC Register
#define CAN1_RXFGMASK                 (*((volatile uint32_t *)0x400A4048))      // Rx FIFO Global Mask register
#define CAN1_RXFIR                    (*((volatile uint32_t *)0x400A404C))      // Rx FIFO Information Register
#define CAN1_RXIMR0                   (*((volatile uint32_t *)0x400A4880))      // Rx Individual Mask Registers
#define CAN1_RXIMR1                   (*((volatile uint32_t *)0x400A4884))      // Rx Individual Mask Registers
#define CAN1_RXIMR2                   (*((volatile uint32_t *)0x400A4888))      // Rx Individual Mask Registers
#define CAN1_RXIMR3                   (*((volatile uint32_t *)0x400A488C))      // Rx Individual Mask Registers
#define CAN1_RXIMR4                   (*((volatile uint32_t *)0x400A4890))      // Rx Individual Mask Registers
#define CAN1_RXIMR5                   (*((volatile uint32_t *)0x400A4894))      // Rx Individual Mask Registers
#define CAN1_RXIMR6                   (*((volatile uint32_t *)0x400A4898))      // Rx Individual Mask Registers
#define CAN1_RXIMR7                   (*((volatile uint32_t *)0x400A489C))      // Rx Individual Mask Registers
#define CAN1_RXIMR8                   (*((volatile uint32_t *)0x400A48A0))      // Rx Individual Mask Registers
#define CAN1_RXIMR9                   (*((volatile uint32_t *)0x400A48A4))      // Rx Individual Mask Registers
#define CAN1_RXIMR10                  (*((volatile uint32_t *)0x400A48A8))      // Rx Individual Mask Registers
#define CAN1_RXIMR11                  (*((volatile uint32_t *)0x400A48AC))      // Rx Individual Mask Registers
#define CAN1_RXIMR12                  (*((volatile uint32_t *)0x400A48B0))      // Rx Individual Mask Registers
#define CAN1_RXIMR13                  (*((volatile uint32_t *)0x400A48B4))      // Rx Individual Mask Registers
#define CAN1_RXIMR14                  (*((volatile uint32_t *)0x400A48B8))      // Rx Individual Mask Registers
#define CAN1_RXIMR15                  (*((volatile uint32_t *)0x400A48BC))      // Rx Individual Mask Registers


//*****************************************************************************
//
// Serial Peripheral Interface (SPI) registers
//
//*****************************************************************************

