MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VMD18/mcu.h
#define TSI0_GENCS                    (*((volatile uint32_t *)0x40045000))      // TSI General Control and Status Register (TSI0_GENCS)
#define TSI0_DATA                     (*((volatile uint32_t *)0x40045004))      // TSI DATA Register (TSI0_DATA)
#define TSI0_TSHD                     (*((volatile uint32_t *)0x40045008))      // TSI Threshold Register (TSI0_TSHD)



//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_PCRn register.
//
//*****************************************************************************

#define ISF                           0x01000000      // Interrupt Status Flag
#define IRQC                          0x00780000      // Interrupt Configuration
#define LK                            0x00008000      // Lock Register
#define MUX                           0x00001C00      // Pin Mux Control
#define DSE                           0x00000040      // Drive Strength Enable
#define ODE                           0x00000020      // Open Drain Enable
#define PFE                           0x00000010      // Passive Filter Enable
#define SRE                           0x00000004      // Slew Rate Enable
#define PE                            0x00000002      // Pull Enable
#define PS                            0x00000001      // Pull Select


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_GPCLR register.
//
//*****************************************************************************

#define GPWE                          0x7FFF80000000      // Global Pin Write Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_GPCHR register.
//
//*****************************************************************************

#define GPWE                          0x7FFF80000000      // Global Pin Write Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_ISFR register.
//
//*****************************************************************************

#define ISF                           0x7FFFFFFF80000000      // Interrupt Status Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_DFER register.
//
//*****************************************************************************

#define DFE                           0x7FFFFFFF80000000      // Digital Filter Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_DFCR register.
//
//*****************************************************************************

#define CS                            0x00000001      // Clock Source


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1 register.
//
//*****************************************************************************

#define USBREGEN                      0x80000000      // USB voltage regulator enable
#define USBSSTBY                      0x40000000      // USB voltage regulator in standby mode during Stop, VLPS, LLS and VLLS modes
#define USBVSTBY                      0x20000000      // USB voltage regulator in standby mode during VLPR and VLPW modes
#define OSC32KSEL                     0x00180000      // 32K oscillator clock select
#define RAMSIZE                       0x00078000      // RAM size


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1CFG register.
//
//*****************************************************************************

#define USSWE                         0x04000000      // USB voltage regulator stop standby write enable
#define UVSWE                         0x02000000      // USB voltage regulator VLP standby write enable
#define URWE                          0x01000000      // USB voltage regulator enable write enable


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_USBPHYCTL register.
//
//*****************************************************************************

#define USBDISILIM                    0x00800000      // USB Disable Inrush Current Limit
#define USB3VOUTTRG                   0x01C00000      // USB 3.3V Output Target
#define USBVREGPD                     0x00000200      // Enables the pulldown on the output of the USB Regulator
#define USBVREGSEL                    0x00000100      // Selects the default input voltage source to the USB Regulator in case both VREG_IN0 and VREG_IN1 are powered


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT2 register.
//
//*****************************************************************************

#define SDHCSRC                       0x60000000      // SDHC clock source select
#define LPUARTSRC                     0x18000000      // LPUART clock source select
#define TPMSRC                        0x06000000      // TPM clock source select
#define USBSRC                        0x00040000      // USB clock source select
#define PLLFLLSEL                     0x00060000      // PLL/FLL clock select
#define TRACECLKSEL                   0x00001000      // Debug trace clock select
#define FBSL                          0x00000600      // FlexBus security level
#define CLKOUTSEL                     0x00000380      // CLKOUT select
#define RTCCLKOUTSEL                  0x00000010      // RTC clock out select
#define USBREGEN                      0x00000002      // USB PHY PLL Regulator Enable
#define USBSLSRC                      0x00000001      // USB Slow Clock Source


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT4 register.
//
//*****************************************************************************

#define FTM3TRG1SRC                   0x80000000      // FlexTimer 3 Hardware Trigger 1 Source Select
#define FTM3TRG0SRC                   0x40000000      // FlexTimer 3 Hardware Trigger 0 Source Select
#define FTM0TRG1SRC                   0x20000000      // FlexTimer 0 Hardware Trigger 1 Source Select
#define FTM0TRG0SRC                   0x10000000      // FlexTimer 0 Hardware Trigger 0 Source Select
#define FTM3CLKSEL                    0x08000000      // FlexTimer 3 External Clock Pin Select
#define FTM2CLKSEL                    0x04000000      // FlexTimer 2 External Clock Pin Select
#define FTM1CLKSEL                    0x02000000      // FTM1 External Clock Pin Select
#define FTM0CLKSEL                    0x01000000      // FlexTimer 0 External Clock Pin Select
#define FTM2CH1SRC                    0x00400000      // FTM2 channel 1 input capture source select
#define FTM2CH0SRC                    0x00600000      // FTM2 channel 0 input capture source select
#define FTM1CH0SRC                    0x00180000      // FTM1 channel 0 input capture source select
#define FTM3FLT0                      0x00001000      // FTM3 Fault 0 Select
#define FTM2FLT0                      0x00000100      // FTM2 Fault 0 Select
#define FTM1FLT0                      0x00000010      // FTM1 Fault 0 Select
#define FTM0FLT3                      0x00000008      // FTM0 Fault 3 Select
#define FTM0FLT2                      0x00000004      // FTM0 Fault 2 Select
#define FTM0FLT1                      0x00000002      // FTM0 Fault 1 Select
#define FTM0FLT0                      0x00000001      // FTM0 Fault 0 Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT5 register.
//
//*****************************************************************************

#define LPUART0RXSRC                  0x00180000      // LPUART0 receive data source select
#define LPUART0TXSRC                  0x00060000      // LPUART0 transmit data source select
#define UART1RXSRC                    0x00000180      // UART 1 receive data source select
#define UART1TXSRC                    0x00000060      // UART 1 transmit data source select
#define UART0RXSRC                    0x00000018      // UART 0 receive data source select
#define UART0TXSRC                    0x00000006      // UART 0 transmit data source select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT7 register.
//
//*****************************************************************************

#define ADC1ALTTRGEN                  0x00008000      // ADC1 alternate trigger enable
#define ADC1PRETRGSEL                 0x00001000      // ADC1 pre-trigger select
#define ADC1TRGSEL                    0x00007800      // ADC1 trigger select
#define ADC0ALTTRGEN                  0x00000080      // ADC0 alternate trigger enable
#define ADC0PRETRGSEL                 0x00000010      // ADC0 pretrigger select
#define ADC0TRGSEL                    0x00000078      // ADC0 trigger select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT8 register.
//
//*****************************************************************************

#define FTM3OCH7SRC                   0x80000000      // FTM3 channel 7 output source
#define FTM3OCH6SRC                   0x40000000      // FTM3 channel 6 output source
#define FTM3OCH5SRC                   0x20000000      // FTM3 channel 5 output source
#define FTM3OCH4SRC                   0x10000000      // FTM3 channel 4 output source
#define FTM3OCH3SRC                   0x08000000      // FTM3 channel 3 output source
#define FTM3OCH2SRC                   0x04000000      // FTM3 channel 2 output source
#define FTM3OCH1SRC                   0x02000000      // FTM3 channel 1 output source
#define FTM3OCH0SRC                   0x01000000      // FTM3 channel 0 output source
#define FTM0OCH7SRC                   0x00800000      // FTM0 channel 7 output source
#define FTM0OCH6SRC                   0x00400000      // FTM0 channel 6 output source
#define FTM0OCH5SRC                   0x00200000      // FTM0 channel 5 output source
#define FTM0OCH4SRC                   0x00100000      // FTM0 channel 4 output source
#define FTM0OCH3SRC                   0x00080000      // FTM0 channel 3 output source
#define FTM0OCH2SRC                   0x00040000      // FTM0 channel 2 output source
#define FTM0OCH1SRC                   0x00020000      // FTM0 channel 1 output source
#define FTM0OCH0SRC                   0x00010000      // FTM0 channel 0 output source
#define FTM3SYNCBIT                   0x00000008      // FTM3 Hardware Trigger 0 Software Synchronization
#define FTM2SYNCBIT                   0x00000004      // FTM2 Hardware Trigger 0 Software Synchronization
#define FTM1SYNCBIT                   0x00000002      // FTM1 Hardware Trigger 0 Software Synchronization
#define FTM0SYNCBIT                   0x00000001      // FTM0 Hardware Trigger 0 Software Synchronization


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT9 register.
//
//*****************************************************************************

