MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VMD18/mcu.h
#define AMC                           0x00007F80      // Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_CR register.
//
//*****************************************************************************

#define SRAMLWP                       0x40000000      // SRAM_L Write Protect
#define SRAMLAP                       0x60000000      // SRAM_L arbitration priority
#define SRAMUWP                       0x04000000      // SRAM_U write protect
#define SRAMUAP                       0x06000000      // SRAM_U arbitration priority


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ISCR register.
//
//*****************************************************************************

#define FIDCE                         0x80000000      // FPU input denormal interrupt enable
#define FIXCE                         0x10000000      // FPU inexact interrupt enable
#define FUFCE                         0x08000000      // FPU underflow interrupt enable
#define FOFCE                         0x04000000      // FPU overflow interrupt enable
#define FDZCE                         0x02000000      // FPU divide-by-zero interrupt enable
#define FIOCE                         0x01000000      // FPU invalid operation interrupt enable
#define FIDC                          0x00008000      // FPU input denormal interrupt status
#define FIXC                          0x00001000      // FPU inexact interrupt status
#define FUFC                          0x00000800      // FPU underflow interrupt status
#define FOFC                          0x00000400      // FPU overflow interrupt status
#define FDZC                          0x00000200      // FPU divide-by-zero interrupt status
#define FIOC                          0x00000100      // FPU invalid operation interrupt status
#define DHREQ                         0x00000008      // Debug Halt Request Indicator
#define NMI                           0x00000004      // Non-maskable Interrupt Pending
#define IRQ                           0x00000002      // Normal Interrupt Pending


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBCC register.
//
//*****************************************************************************

#define ITDIS                         0x00000020      // ITM-To-TPIU Disable
#define ETDIS                         0x00000010      // ETM-To-TPIU Disable
#define RLRQ                          0x00000008      // Reload Request
#define RSPT                          0x0000000C      // Response Type
#define CNTEN                         0x00000001      // Counter Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBRL register.
//
//*****************************************************************************

#define RELOAD                        0x001FFC00      // Byte Count Reload Value


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBCNT register.
//
//*****************************************************************************

#define COUNTER                       0x001FFC00      // Byte Count Counter Value


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_FADR register.
//
//*****************************************************************************

#define ADDRESS                       0x7FFFFFFF80000000      // Fault address


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_FATR register.
//
//*****************************************************************************

#define BEOVR                         0x80000000      // Bus error overrun
#define BEMN                          0x00007800      // Bus error master number
#define BEWT                          0x00000080      // Bus error write
#define BESZ                          0x00000060      // Bus error size
#define BEMD                          0x00000002      // Bus error privilege level
#define BEDA                          0x00000001      // Bus error access type


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_FDR register.
//
//*****************************************************************************

#define DATA                          0x7FFFFFFF80000000      // Fault data


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PID register.
//
//*****************************************************************************

#define PID                           0x00007F80      // M0_PID And M1_PID For MPU


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_CPO register.
//
//*****************************************************************************

#define CPOWOI                        0x00000004      // Compute Operation wakeup on interrupt
#define CPOACK                        0x00000002      // Compute Operation acknowledge
#define CPOREQ                        0x00000001      // Compute Operation request


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_PRSn register.
//
//*****************************************************************************

#define M6                            0x1C000000      // Master 6 Priority. Sets the arbitration priority for this port on the associated slave port
#define M5                            0x01C00000      // Master 5 Priority. Sets the arbitration priority for this port on the associated slave port
#define M4                            0x001C0000      // Master 4 Priority. Sets the arbitration priority for this port on the associated slave port
#define M3                            0x0001C000      // Master 3 Priority. Sets the arbitration priority for this port on the associated slave port
#define M2                            0x00001C00      // Master 2 Priority. Sets the arbitration priority for this port on the associated slave port
#define M1                            0x000001C0      // Master 1 Priority. Sets the arbitration priority for this port on the associated slave port
#define M0                            0x00000078      // Master 0 Priority. Sets the arbitration priority for this port on the associated slave port


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_CRSn register.
//
//*****************************************************************************

#define RO                            0x80000000      // Read Only
#define HLP                           0x40000000      // Halt Low Priority
#define ARB                           0x00000600      // Arbitration Mode
#define PCTL                          0x00000060      // Parking Control
#define PARK                          0x00000078      // Park


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_MGPCRn register.
//
//*****************************************************************************

#define AULB                          0x00000001      // Arbitrates On Undefined Length Bursts


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_MPRA register.
//
//*****************************************************************************

#define MTR0                          0x40000000      // Master 0 Trusted For Read
#define MTW0                          0x20000000      // Master 0 Trusted For Writes
#define MPL0                          0x10000000      // Master 0 Privilege Level
#define MTR1                          0x04000000      // Master 1 Trusted for Read
#define MTW1                          0x02000000      // Master 1 Trusted for Writes
#define MPL1                          0x01000000      // Master 1 Privilege Level
#define MTR2                          0x00400000      // Master 2 Trusted For Read
#define MTW2                          0x00200000      // Master 2 Trusted For Writes
#define MPL2                          0x00100000      // Master 2 Privilege Level
#define MTR3                          0x00040000      // Master 3 Trusted For Read
#define MTW3                          0x00020000      // Master 3 Trusted For Writes
#define MPL3                          0x00010000      // Master 3 Privilege Level
#define MTR4                          0x00004000      // Master 4 Trusted For Read
#define MTW4                          0x00002000      // Master 4 Trusted For Writes
#define MPL4                          0x00001000      // Master 4 Privilege Level
#define MTR5                          0x00000400      // Master 5 Trusted For Read
#define MTW5                          0x00000200      // Master 5 Trusted For Writes
#define MPL5                          0x00000100      // Master 5 Privilege Level
#define MTR6                          0x00000040      // Master 6 Trusted for Read
#define MTW6                          0x00000020      // Master 6 Trusted for Writes
#define MPL6                          0x00000010      // Master 6 Privilege Level


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_PACRn register.
//
//*****************************************************************************

