MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VMD18/mcu.h
#define Bits [95:64] of data entry    0x800000000000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnML register.
//
//*****************************************************************************

#define Bits [63:32] of data entry    0x8000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnLM register.
//
//*****************************************************************************

#define Bits [31:0] of data entry     0x80000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnUM register.
//
//*****************************************************************************

#define Bits [127:96] of data entry   0x80000000000000000000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnMU register.
//
//*****************************************************************************

#define Bits [95:64] of data entry    0x800000000000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnML register.
//
//*****************************************************************************

#define Bits [63:32] of data entry    0x8000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnLM register.
//
//*****************************************************************************

#define Bits [31:0] of data entry     0x80000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnUM register.
//
//*****************************************************************************

#define Bits [127:96] of data entry   0x80000000000000000000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnMU register.
//
//*****************************************************************************

#define Bits [95:64] of data entry    0x800000000000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnML register.
//
//*****************************************************************************

#define Bits [63:32] of data entry    0x8000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnLM register.
//
//*****************************************************************************

#define Bits [31:0] of data entry     0x80000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnUM register.
//
//*****************************************************************************

#define Bits [127:96] of data entry   0x80000000000000000000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnMU register.
//
//*****************************************************************************

#define Bits [95:64] of data entry    0x800000000000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnML register.
//
//*****************************************************************************

#define Bits [63:32] of data entry    0x8000000000000000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSARn register.
//
//*****************************************************************************

#define BA                            0x7FFF80000000      // Base Address


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSMRn register.
//
//*****************************************************************************

#define BAM                           0x7FFF80000000      // Base Address Mask
#define WP                            0x00000100      // Write Protect
#define V                             0x00000001      // Valid


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSCRn register.
//
//*****************************************************************************

#define SWS                           0x1F80000000      // Secondary Wait States
#define -                             0x06000000      // Reserved
#define SWSEN                         0x00800000      // Secondary Wait State Enable
#define EXTS                          0x00400000      // Extended Transfer Start/Extended Address Latch Enable
#define ASET                          0x00600000      // Address Setup
#define RDAH                          0x00180000      // Read Address Hold or Deselect
#define WRAH                          0x00060000      // Write Address Hold or Deselect
#define WS                            0x001F8000      // Wait States
#define BLS                           0x00000200      // Byte-Lane Shift
#define AA                            0x00000100      // Auto-Acknowledge Enable
#define PS                            0x00000180      // Port Size
#define BEM                           0x00000020      // Byte-Enable Mode
#define BSTR                          0x00000010      // Burst-Read Enable
#define BSTW                          0x00000008      // Burst-Write Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the SDRAM_CTRL register.
//
//*****************************************************************************

