MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VMD18/mcu.h
#define RXADD                         0x007F8000      // Receive Address.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_GPTIMERnLD register.
//
//*****************************************************************************

#define GPTLD                         0x7FFFFF800000      // Specifies the value to be loaded into the countdown timer on a reset.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_GPTIMERnCTL register.
//
//*****************************************************************************

#define RUN                           0x80000000      // Timer Run


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_USB_SBUSCFG register.
//
//*****************************************************************************

#define BURSTMODE                     0x0000001C      // Burst mode


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HCIVERSION register.
//
//*****************************************************************************

#define HCIVERSION                    0x7FFF80000000      // EHCI revision number


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HCSPARAMS register.
//
//*****************************************************************************

#define N_TT                          0x78000000      // Number of Transaction Translators.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HCCPARAMS register.
//
//*****************************************************************************

#define EECP                          0x007F8000      // EHCI Extended Capabilities Pointer


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_DCIVERSION register.
//
//*****************************************************************************

#define -                             0x7FFF80000000      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_DCCPARAMS register.
//
//*****************************************************************************

#define -                             0x3FFFFF80000000      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_USBCMD register.
//
//*****************************************************************************

#define -                             0x7F80000000      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_USBSTS register.
//
//*****************************************************************************

#define -                             0x1F80000000      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_USBINTR register.
//
//*****************************************************************************

#define -                             0x1F80000000      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_FRINDEX register.
//
//*****************************************************************************

#define -                             0x1FFFF80000000      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_PERIODICLISTBASE register.
//
//*****************************************************************************

#define PERBASE                       0x7FFFF80000000      // Base address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_DEVICEADDR register.
//
//*****************************************************************************

#define USBADRA                       0x3F80000000      // Device Address Advance


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_ASYNCLISTADDR register.
//
//*****************************************************************************

#define ASYBASE                       0x3FFFFFF80000000      // Link pointer low (LPL)


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_EPLISTADDR register.
//
//*****************************************************************************

#define EPBASE                        0xFFFFF80000000      // Endpoint list address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_TTCTRL register.
//
//*****************************************************************************

#define TTHA                          0x1FC0000000      // TT Hub Address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_BURSTSIZE register.
//
//*****************************************************************************

#define TXPBURST                      0x007F8000      // Programable TX Burst length


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_TXFILLTUNING register.
//
//*****************************************************************************

#define TXFIFOTHRES                   0x07E00000      // FIFO burst Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_ENDPTNAK register.
//
//*****************************************************************************

#define EPTN                          0x00780000      // TX Endpoint NAK


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_ENDPTNAKEN register.
//
//*****************************************************************************

#define EPTNE                         0x00780000      // TX Endpoint NAK


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_CONFIGFLAG register.
//
//*****************************************************************************

#define -                             0x3FFFFFFF80000000      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_OTGSC register.
//
//*****************************************************************************

#define -                             0x80000000      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_USBMODE register.
//
//*****************************************************************************

#define -                             0xFFFF80000000      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_PWDn register.
//
//*****************************************************************************

#define RXPWDRX                       0x00100000      // Power-down the entire USB PHY receiver block except for the full-speed differential receiver
#define RXPWDDIFF                     0x00080000      // Power-down the USB high-speed differential receiver
#define RXPWD1PT1                     0x00040000      // Power-down the USB full-speed differential receiver
#define RXPWDENV                      0x00020000      // Power-down the USB high-speed receiver envelope detector (squelch signal)
#define TXPWDV2I                      0x00001000      // Power-down the USB PHY transmit V-to-I converter and the current mirror
#define TXPWDIBIAS                    0x00000800      // Power-down the USB PHY current bias block for the transmitter
#define TXPWDFS                       0x00000400      // Power-down the USB full-speed drivers


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_TXn register.
//
//*****************************************************************************

